---
kind: property
id: P:Autodesk.Revit.DB.SunAndShadowSettings.ActiveFrameTime
source: html/b675e63b-2f7e-75d8-7843-069dbf933195.htm
---
# Autodesk.Revit.DB.SunAndShadowSettings.ActiveFrameTime Property

Identifies the date and time of the SunAndShadowSettings element for the active frame.

## Syntax (C#)
```csharp
public DateTime ActiveFrameTime { get; }
```